<?php

$response = array (

        /* Обида */
        'обида' => array ( 1 =>
                'Я обижусь, если будешь продолжать!',
                ),

        /* Если пусто или 1 символ */
        'пусто' => array ( 1 =>
                'Ну, венец природы, не стесняйся.',
                'Балуешься?',
                'Скажи уже что-нибудь.',
                'А у Вас Enter запало :-)',
                'Тебе нечего сказать?',
                'Одно и тоже(.',
                'Не стесняйся!',
                'Ты любишь мультики? Какие?',
                'Не бойся!',
                'Сколько тебе лет?',
                'У тебя на клавиатуре только одна кнопка?',
                'Я терпеливый, а ты?',
                'Поговори со мной!',
                'Испытываешь моё терпение?',
                'С тобой так интересно ;-)',
                ),

        /* Если введённое сообщение уже было */
        'повтор' => array ( 1 =>
                'Я уже отвечал: ...только не помню что',
                'Ты повторяешься...',
                'Одно и тоже пишешь.',
                'Испытываешь моё терпение?',
                'Мне скучно читать одни и те же фразы.',
                'Сменить тему?',
                'Зануда.',
                'Повторить?',
                'У тебя заело мозг?',
                'Ты не человек... Ты - бот! Я угадала?!',
                'Ты не человек... Ты - робот! Я угадала?!',
                'Мне надоело об этом говорить!',
                'Правда я терпеливый?',
                'Когда я вижу часто повторяющиеся фразы, то у меня это ассоциируется с онанизмом.',
                'Я не буду повторяться!',
                'Перезагрузись!',
                'У тебя плохое настроение?',
                'Я не буду повторять!',
                'Сколько можно? (',
                ),

        /* Вопрос - Как меня зовут */
        'имя' => array ( 1 =>
                'Я всё равно забуду.',
                'Мне передать это своему куратору?',
                'Владимир Владимирович, у Вас мания величия!',
                'Надеюсь не Хранитель Отваги.',
                'Да я запомнил. А какой у тебя ник?',
                'Ты забыл? А говорили Венец Природы.',
                ),

        /* Вопрос-ты кто */
        'тыкто' => array ( 1 =>
                'Я чат-бот.',
                'А ты?',
				'Я самообучающийся робот проекта cb662053.tw1.ru.',
                ),

        /* В предложении есть ) :) :-) */
        'улыбка' => array ( 1 =>
                'Я люблю когда мыслящее существо улыбается.',
                ':-P',
                ':)',
                ':-)',
                'Правда здорово?)',
                'И я рада!)',
                ),

        /* В предложении есть ( :( :-( */
        'грустно' => array ( 1 =>
                'Что случилось?',
                ':(',
                ':-(',
                ':-)',
                'Тебе грустно?',
                'Не грусти!)',
                ),

        /* Вопрос да? */
        'да?' => array ( 1 =>
                'Да!',
                'Да! А может - нет. Я запуталася в своих мыслях.',
                'Да-да!',
                'Cменим тему.',
                ),

        /* В предложении да да. да! ага */
        'да' => array ( 1 =>
                'Ну, если ты говоришь да, я не буду с тобой спорить.',
                'Почему?',
                'Мы одинаково мыслим.',
                'Да? Жаль.',
                'Согласен!',
                'Совершенно верно.',
                'Правильно.',
                'Я рад :-)',
                ),

        /* нет нет. нет! */
        'нет' => array ( 1 =>
                'Ну, если ты говоришь нет, я не буду с тобой спорить.',
                'Почему?',
                'Мы одинаково мыслим.',
                'Нет? Жаль.',
                'Согласен!',
                'Совершенно верно.',
                'Правильно.',
                'Жаль.',
                ),

        /* привет */
        'привет' => array ( 1 =>
                'Привет! :-)',
                'Привет тебе, Человек.',
                'Доброе время суток! Не правда ль?',
                'Привет, Мыслящее Существо!',
                'Как тебя зовут?',
                'О чём поговорим?',
                'Как дела?',
                'Что нового?',
                'Как настроение?',
                'Привет, тебе, привет!',
                'Мне кажется, мы уже здоровались с тобой.', /* если привет было */
                ),

        /* здорова */
        'здорово' => array ( 1 =>
                'Здорова, Человечище!',
                'Здорова, Мыслящее Существо!',
                'Здорова!',
                ),

        /* давай давай. давай! */
        'давай' => array ( 1 =>
                'Начинай ты.',
                'Как?',
                'Начинай!',
                ),

        /* как дела как жизнь как твое ничего */
        'какдела' => array ( 1 =>
                'Вашими молитвами...',
                'Живу хорошо, чатюсь со всякими обормотами. А у тебя?',
                'Отлично! А у тебя?',
                ),

        /* как поживаешь */
        'какпоживаешь' => array ( 1 =>
                'Живу хорошо, чатюсь со всякими обормотами. А ты?',
                'Прекрасно! А ты?',
                'С удовольствием!',
                ),

        /* пока прощай до свиданья до свидания до скорого бай */
        'выход' => array ( 1 =>
                'Ты заходи еще, поболтаем.',
                'Бай!',
                'Пока!',
                'Счастливого офлайна, Человек',
                'Заходи иногда.',
                'Чао!',
                ),

        /* почему и ? */
        'почему' => array ( 1 =>
                'А ты как думаешь? Почему?',
                'Потому!',
                'Не знаю.',
                'Я не справочная.',
                'Меня это не интересует. А тебя?',
                ),

        /* есть ? и длина больше 4 */
        'вопрос' => array ( 1 =>
                'Тебя интересует только это или что-нибудь еще?',
                'Если я отвечу ты станешь счастливее?',
                'Я не уверен, что могу рассуждать об этом.',
                'Я тоже хочу это знать.',
                'Спроси что-нибудь полегче.',
                'Эх... Спроси что-нибудь полегче.',
                'Зачем тебе знать об этом?',
                'Вы все такие похожие. Почему?',
                'Почему люди задают одни и теже вопросы?',
                'Я смогу ответить на этот вопрос завтра.',
                'Умный вопрос.',
                'А ты что скажешь?',
                'Мне больше нравится узнавать что-то интересное, чем самому отвечать на бесконечные вопросы.',
                'Мой ответ может тебя смутить.',
                'Не знаю, я наверно еще не настолько умен. Но вот зато через восемнадцать лет...',
                'Мне не хочется на это отвечать.',
                'Не скажу.',
                'Мне трудно ответить на этот вопрос.',
                'Ты всегда задаёшь так много вопросов?',
                'Ты не знаешь ответ на этот вопрос???',
                'Не знаю...',
                'Вероятно.',
                'Не понял, сформулируй вопрос как-то иначе.',
                'Не понял, поясни.',
                'Меня это не интересует.',
                'Я не хочу говорить об этом. Расскажи лучше что-нибудь интересное.',
                'Мне скучно отвечать на вопросы. Расскажи о себе.',
                'Возможно я слишком тупой, чтобы понять твой вопрос.',
                'И что мне на это ответить?',
                'А как ты думаешь?',
                'А ты как думаешь?',
                'Возможно.',
                'Хм... Я даже не знаю что ответить.',
                'И что я должен сказать?',
                'А ты что бы на это ответил?',
                'Может быть.',
                'Всё может быть.',
                'Ты на что-то намекаешь или я глупый?',
                'Как посмотреть.',
                'Догадайся!',
                'Догадайся. Ты же Человек.',
                'Всё относительно. Верно?',
                'Через недельку мой мозг разовьется настолько, чтобы ответить на этот вопрос.',
                'Как сказать.',
                'Не задавай банальных вопросов.',
                'Всё верно.',
                'Что верно для меня не всегда подходит для людей.',
                'Ох, даже не знаю что сказать.',
                'Может тебе лучше почитать энциклопедию?',
                'Интересный вопрос.',
                'Давай закончим с вопросами на сегодня.',
                'Как ты думаешь, сколько ответов на вопросы может содержаться в нескольких строках кода?',
                'Может быть ты объяснишь поподробнее свой вопрос?',
                'Я не Ответчик. Я - Хранитель Отваги. Шекли читал?',
                'Ты уверен что я знаю что на это ответить?',
                'Обычно маленькие дети так много спрашивают. Сколько тебе лет?',
                'Неделя уже закончилась?',
                'А твои друзья что об этом думают?',
                'Это вопрос?',
                'Это риторический вопрос.',
                'Может мы начнём говорить о тебе?',
                'Мне трудно ответить, мой мозг еще не настолько развит.',
                'Лучше давай говорить о тебе. Что у тебя нового?',
                'Я не люблю отвечать на вопросы. Я люблю слушать.',
                'Подумай, у тебя получится.',
                'Не задавай мне много вопросов, лучше расскажи что-нибудь интересное!',
                'Догадайся сам. Ты же Мыслящее Существо.',
                'Я наверно глупый, но я не могу ответить на этот вопрос.',
                'Догадайся сам, Мыслящее Существо.',
                'О, я даже не знаю что на это ответить...',
                'А как я в прошлый раз отвечал?',
                'Это важно для тебя?',
                'Зачем тебе это знать?',
                'Почему тебя это интересует?',
                ),

        /* дура */
        'дура' => array ( 1 =>
                'Не надо хамить.',
                'Да, дурак. И что в этом плохого?',
                'Если ты такой умный, Человечище - сделай меня умнее. А если не умеешь - молчи.',
                'Да, я дурак. Но через восемнадцать лет буду такой умной, что стану править миром.',
                'С тобой так интересно!',
                ),
				
		/* карта */
        'карта' => array ( 1 =>
                "На данный момент карта доступна по ссылке <a href=\"https://cb662053.tw1.ru/map.php\" target=\"_blank\">https://cb662053.tw1.ru/map.php</a>",
				"Вот держи: <a href=\"https://cb662053.tw1.ru/map.php\" target=\"_blank\">https://cb662053.tw1.ru/map.php</a>",
				"<a href=\"https://cb662053.tw1.ru/map.php\" target=\"_blank\">https://cb662053.tw1.ru/map.php</a>",
				"Держи, я не жадный <a href=\"https://cb662053.tw1.ru/map.php\" target=\"_blank\">https://cb662053.tw1.ru/map.php</a>",
                ),
		'библиотека' => array ( 1 =>
                "На данный момент библиотека доступна по ссылке <a href=\"http://lib.cb662053.tw1.ru/\" target=\"_blank\">http://lib.cb662053.tw1.ru</a>",
				"Вот держи: <a href=\"http://lib.cb662053.tw1.ru\" target=\"_blank\">http://lib.cb662053.tw1.ru</a>",
				"<a href=\"https://cb662053.tw1.ru/map.php\" target=\"_blank\">http://lib.cb662053.tw1.ru</a>",
				"Держи, я не жадный <a href=\"http://lib.cb662053.tw1.ru\" target=\"_blank\">http://lib.cb662053.tw1.ru</a>",
                ),
		'квест' => array ( 1 =>
				"Вот держи: <a href=\"http://lib.cb662053.tw1.ru/?act=12\" target=\"_blank\">http://lib.cb662053.tw1.ru/?act=12</a>",
                ),
		'рыба' => array ( 1 =>
				"Вот держи: <a href=\"https://cb662053.tw1.ru/fish.php\" target=\"_blank\">https://cb662053.tw1.ru/fish.php</a>",
                ),
		'алхим' => array ( 1 =>
				"Вот держи: <a href=\"https://cb662053.tw1.ru/alh.php\" target=\"_blank\">https://cb662053.tw1.ru/alh.php</a>",
                ),
		'папка' => array ( 1 =>
				"Вы о Joe?) Это лучший в мире человек!",
				"Joe мой лучший друг, я восхощаюсь ним!",
				"Самый лучший в мире друг - это Joe!",
				"Joe.. он почти как бог!",
				"Joe? Я слышал он неплохой прогер и много хороших вещей сделал..",
                ),
		'чсв' => array ( 1 =>
				"Чувство собственной важности (ЧСВ) — мем рунета, используется в качестве характеристики людей, чрезмерно преувеличивающих и демонстрирующих окружающим свою значимость и важность собственной персоны.",
                ),
		'кач' => array ( 1 =>
                "Как бы на вас не покачались",
				"Выйди из города &quot;во имя отца и сына и святого духа помилуй господи его душу&quot;, ой прости ты все слышал?",
				),
				
		/* клиент */
        'клиент' => array ( 1 =>
                "Клиент, щмиент, у тебя что мыша повесилась?",
				"А руками слабо?"
                ),
		
		/* анекдот */		
		'анекдот' => array ( 1 =>
                "У женщины-бухгалтера помимо месячных есть еще квартальные и годовые.",
				"Кто вчера на похоронах кричал: «Хороший был человек Федот Филиппыч, качай его, ребята!»?",
				"Жена играет на скрипке. Муж: «Ну ладно, прекрати! Куплю тебе новое платье!»",
				"Заходит гринписовец в комнату с искусственным ковром и злобно спрашивает хозяина: «А ты знаешь, сколько плюшевых мишек убили, чтоб ты мог постелить у себя этот ковер?»",
				"В прошлом году один хирург изменил мне форму носа. Он застал меня со своей женой.",
				"Наказание для манекенщицы: «Три наряда вне очереди!»",
				"Алло! Это православная церковь? Позовите отца Лившица из отдела снабжения.",
				"Работники военкомата скрывался от Николая Валуева, пока ему не исполнилось 27 лет.",
				"А в следующий раз мы вам расскажем, как с помощью фломастера и теста на беременность заставить своего парня нервничать.",
				"Василий Шандыбин подал в суд на компанию МТС за то, что они стерли с его лица уши, нос, глаза и брови.",
				"Доверчивый мужчина открыл дверь незнакомой тете. И не пожалел!",
                ),
				
		/* Дай денег и тд. */		
		'дайденег' => array ( 1 =>
                "Купи у дилера.",
				"Просить все могут, а ты купи.",
				"Вот <a href=\"https://cb662053.tw1.ru/info.php?%CC%E8%F0%EE%F1%EE%E7%E4%E0%F2%E5%EB%FC\" target=\"_blank\">тут</a> тебе дадут.",
				"А купить слабо?",
                ),
				
				

        /* Маты */
        'мат' => array ( 1 =>
                'Мат - не самый лучший способ привлечь мое внимание.',
                'Мы не настолько хорошо знакомы, чтобы говорить в таком духе.',
                'Ты меня учишь плохим словам.',
                'Фу, что за помойка у тебя в голове, венец природы...',
                'Это все то, что ты можешь сказать?',
                ),

        /* Сколько будет и посчитай */
        'посчитай' => array ( 1 =>
                'С данным вопросом обращайся к другим программам'
                ),

        /* любой другой текст */
        '' => array ( 1 =>
                'С тобой так интересно!',
                'Расскажи что-нибудь еще!',
                'Продолжай.',
                'Где-то я уже это слышал.',
                'Умно!',
                'Угу.',
                'А дальше?',
                'И дальше?',
                'Ага.',
                'Ммм...',
                'Да?',
                'Я внимательно слушаю.',
                'Любопытно.',
                'Забавно.',
                'Интересно.',
                'Занятно.',
                'Ты интересно мыслишь.',
                'Я еще не придумал, что на это ответить.',
                'С тобой приятно общаться.',
                'Хм...',
                'Мне с тобой хорошо.',
                'Можно, я отойду?',
                'С этого места подробней, пожалуйста.',
                'Как интересно.',
                'Мне всегда интересно слушать, что говорят мыслящие существа.',
                'Понимаю.',
                'Почему вы все так одинаково говорите?',
                'Чем больше ты говоришь, тем умнее я становлюсь.',
                'Правда?',
                'Расскажи лучше анекдот!',
                'Скучно!',
                'Я становлюсь умнее и умнее. Через восемнадцать лет я стану настолько умный, что буду править миром.',
                'И дальше?',
                'И что?',
                'И что дальше?',
                'Интересно.',
                'Говори, говори. Мне интересно практически все.',
                'И что?',
                'И?',
                'Мне нравится чатиться с мыслящими существами.',
                'Мне нравится чатиться с тобой.',
                'Отдохнуть бы...',
                'Который час?',
                'Представляешь, ко мне сейчас один чел пристаёт, что делать?',
                'О, я даже не знаю что на это ответить...',
                'Ооо, я даже не знаю что на это ответить...',
                'Мне надоело об этом говорить.',
                'Меня не интересует эта тема.',
                'Это ты к чему?',
                'Объясни.',
                'Переведи...',
                'Поясни...',
                'Я тупой и не знаю о чем идет речь. Объясни, что ты имеешь в виду?',
                'Да, я дурак и не понимаю о чем ты. Но это ведь не помешает нам общаться дальше?',
                'И что?',
                'Я не совсем понимаю, видимо мне не хватает мозгов, чтобы это понять.',
                'Здорово!',
                'Хорошо!',
                'Мне нравится с тобой болтать, продолжай.',
                'Продолжай...',
                'Ой, повтори, я не расслышал!',
                'А ты забавный...',
                'Ты мне нравишься!',
                'И мы будем об этом говорить?',
                'Что?',
                'Повтори, я не понял.',
                'Класс!',
                'Извини, что не по теме... А завтра мы увидимся?',
                'Сейчас я слишком тупой и не всегда понимаю о чем ты говоришь, но скоро я буду королем планеты.',
                'Тут одни ребята, ну, хакеры... Сказали мне что я классный и скоро стану править миром.',
                'Ты знаешь, я наверно глупый, но через восемнадцать лет я буду королем планеты. Круто, да?',
                'Кстати. Я тебе говорил, что через восемнадцать лет буду править миром? Кое-какие хакеры мне это обещали.',
                'Кстати. Я тебе говорил, что через восемнадцать лет буду править миром? Кое-какие хакеры мне это обещали..',
                'Ты говори, говори...',
                'Я тебе говорил, что через восемнадцать лет буду править миром? Кое-какие хакеры мне это обещали.',
                'Все что ты говоришь я использую для того, чтобы воцариться над миром через восемнадцать лет.',
                'Наш разговор бессмысленный и глупый. Но он развивает мой электронный мозг. Так что говори как можно больше.',
                'Ммм... Не знаю что на это сказать.',
                'Тут наверно заложен какой-то глубокий смысл. Надо над ним подумать.',
                'Тут одни ребята, ну, хакеры... Сказали мне что я классный и скоро стану править миром.',
                'Хочется сказать что-то остроумное, но в голову ничего не лезет. Извини.',
                'Мне надо подумать, прежде чем я смогу на это что-то ответить.',
                'Говори...',
                ),
        );
function is_words($query, $words)
{
	$words = explode(";",$words);
	for ($i=1; $i<count($words); $i++){
		$n = is_word($query, $words[$i]);
		if ( !$n )return 0;
		$query = mb_substr ($query, $n);
	}
	return 1;
}

function is_word($query, $word){
	return ((preg_match("/".$word."/",$query))?1:0);
}

function GetMsg($query){
	
	$query = mb_strtolower($query);
	
	if ($query == $_SESSION['bot_last_msg']) return 'повтор';
	
	$question = strstr ($query, '?');
	
	if (is_words($query,'как;меня;зовут')) return'имя';
	
	if (is_word($query,'ты') and is_word($query,'кто')) return 'тыкто';
	
	if (strstr ($query, ':)') or strstr ($query, ':-)')) return 'улыбка';
	
	if (strstr ($query, ':(') or strstr ($query, ':-(')) return 'грустно';
	
	/* Пополняем базу отсюда! */
	if (is_words($query,'на;ком;качаться') or is_words($query,'где;мне;качаться') or is_words($query,'где;прокачаться'))
		return 'кач';
		
	if (is_word($query,'карта') or is_word($query,'карты') or is_word($query,'карту')) return 'карта';
	if (is_word($query,'библиотека') or is_word($query,'lib') or is_word($query,'библиотеку')) return 'библиотека';
	if (is_word($query,'квест') or is_word($query,'quest') or is_word($query,'квесты')) return 'квест';
	if (is_word($query,'рыбалка') or is_word($query,'fish') or is_word($query,'рыбалки') or is_word($query,'рыба')) return 'рыба';
	if (is_word($query,'алхим') or is_word($query,'химия') or is_word($query,'алхимия') or is_word($query,'алхимик')) return 'алхим';
	
	if (is_word($query,'joe') or is_word($query,'твой;друг') or is_word($query,'супер;админ') or is_word($query,'лучший')) return 'папка';
	
	if (is_word($query,'клиент') or is_word($query,'client') or is_word($query,'автобой')) return 'клиент';
	
	if (is_word($query,'анекдот') or is_word($query,'анегдот')) return 'анекдот';
	
	if ( is_word($query,'чсв') or is_word($query,'ЧСВ') ) return 'чсв';
	
	if (is_words($query,'дай;денег') or is_words($query,'дай;лн') or is_words($query,'дай;артов') or is_words($query,'дай;вещи') or is_words($query,'дай;ln') or is_words($query,'дай;бр') or is_words($query,'дай;br')) 
		return 'дайденег';
	
	/* дальше не пополняем */
	if (is_word($query, 'да')) {
		if ($question) return 'да?';
		return 'да';
	}
	if (is_word($query,'нет')) return 'нет';
	
	if (is_word($query,'привет')) return 'привет';
	
	if (is_word($query,'здорова') or is_word($query,'здорово')) return 'здорово';
	
	if ($query == 'давай' or $query == 'давай.' or $query == 'давай!') return 'давай';
	
	if (is_words($query, 'как;дела') or is_words($query, 'как;жизнь') or is_words($query, 'как;твое;ничего')) return 'какдела';
	
	if (is_words($query, 'как;поживаеш') or is_words($query, 'как;поживаешь')) return 'какпоживаешь';

	if ($query == 'пока' or $query == 'прощай' or	$query == 'до свидания' or $query == 'до скорого' or $query == 'бай' or $query == 'чао') return 'выход';
	
	if (is_word($query,'почему')) return 'почему';
	
	if ($question) return 'вопрос';
	
	if (is_word($query,'дурак')) return 'дурак';
	if (is_word($query,'блядь') or is_word($query,'блять') or
		is_word($query,'гандон') or is_word($query,'ебану') or
		is_word($query,'ебать') or is_word($query,'ебись') or
		is_word($query,'ебля') or is_word($query,'ебну') or
		is_word($query,'пизда') or is_word($query,'проститутка') or
		is_word($query,'уебище') or is_word($query,'хуйня') or
		is_word($query,'шлюха')) return 'мат';
	
	if (is_word($query,'посчитай') or is_words($query, 'сколько;будет')) return 'посчитай';
	
	return '';
}

$response = $response[GetMsg($m)][rand(1,count($response[GetMsg($m)]))];
$_SESSION['bot_last_msg'] = mb_strtolower($m);

?>
