<?php
echo "<p class=weapons_box>
<b class=ma>Приводи друзей в игру и зарабатывай LN!</b> <br>Если человек регистрируется по вашей реферальной ссылке (т.е. заходит по ней, видит главную страницу, а потом регистрируется), то вы сразу получаете <b>10 LN и 1 Пергамент</b>, а при получение каждого 5ого уровня этим перснажем вы получаете по 50 LN и 2 Пергамент.
Так же при достижении этим персонажем 15 уровня вам на счёт насчитывается 250 LN.!
<font class=items>Ваша уникальная ссылка: <br> <font class=ma>
http://".HOST."/into.php?id=".$player->pers["uid"]." </font> <br>С уважением, Администрация ".HOST.".</font><br>
</p>";

?>